import React, {useEffect, useState} from 'react';
import Header from "../components/header";
import axios from "axios";
import {tokenHeader} from "../Constants/constants";
import image1 from "../image/img.png";
import {useNavigate} from "react-router-dom";

const MainPage = () => {
    const history = useNavigate()
    const [firstname, setName] = useState([])
    const [lastname, setLastName] = useState([])
    const [skills, setSkills] = useState([])
    const [data, setData] = useState({})

    useEffect(() => {
        axios.get('https://test.it-planet.org/user/profile/personal', tokenHeader).then((res) => {
            console.log(res.data);
            setSkills(res.data.skills)
            setData(res.data)
            setName(res.data.firstname)
            setLastName(res.data.lastname)
        })
    }, [])
    return (
        <div className={'mainPageWrapper'}>
            <div className={"forHeaderPage"}>
                <div className={'d-flex p-3 gap-3'} style={{width: '50%'}}>
                    <div style={{fontSize: '16px', fontWeight: 'bold'}}>LOGO</div>
                    <div>
                        <div className={'d-flex '}>
                            <div>
                                <svg width="9" height="15" viewBox="0 0 9 15" fill="none"
                                     xmlns="http://www.w3.org/2000/svg">
                                    <path
                                        d="M4.83302 7.44367C4.83895 6.03804 5.16074 4.65396 5.77194 3.40513C6.38315 2.15631 7.26633 1.07838 8.34892 0.259925C7.39406 0.0604949 6.41027 0.0737214 5.46052 0.298758C4.51078 0.523794 3.61601 0.955682 2.8335 1.56677C2.05099 2.17787 1.39797 2.9547 0.916255 3.84754C0.434538 4.74038 0.134735 5.72956 0.0360368 6.75175C-0.0626612 7.77395 0.0419208 8.80663 0.343088 9.7837C0.644255 10.7608 1.13537 11.6607 1.785 12.4259C2.43463 13.1911 3.22845 13.8046 4.11565 14.2273C5.00286 14.65 5.96389 14.8724 6.93724 14.8805C7.41153 14.8792 7.88449 14.8274 8.34892 14.7258C7.25269 13.8985 6.36102 12.805 5.74911 11.5377C5.1372 10.2703 4.823 8.86612 4.83302 7.44367Z"
                                        fill="#DBE1F7"/>
                                </svg>
                            </div>
                            <div className={'position-relative'}>
                                <div>
                                    <svg width="37" height="15" viewBox="0 0 37 15" fill="none"
                                         xmlns="http://www.w3.org/2000/svg">
                                        <rect x="0.348938" width="36" height="15" rx="7.5" fill="#869AE3"
                                              fill-opacity="0.3"/>
                                    </svg>
                                </div>
                                <div className={'position-absolute'} style={{top: '2px', right: '-2px'}}>
                                    <svg width="22" height="21" viewBox="0 0 22 21" fill="none"
                                         xmlns="http://www.w3.org/2000/svg">
                                        <g filter="url(#filter0_d_1_58)">
                                            <circle cx="8.84894" cy="8.5" r="5.5" fill="white"/>
                                        </g>
                                        <defs>
                                            <filter id="filter0_d_1_58" x="0.348938" y="0" width="21" height="21"
                                                    filterUnits="userSpaceOnUse" color-interpolation-filters="sRGB">
                                                <feFlood flood-opacity="0" result="BackgroundImageFix"/>
                                                <feColorMatrix in="SourceAlpha" type="matrix"
                                                               values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                                                               result="hardAlpha"/>
                                                <feOffset dx="2" dy="2"/>
                                                <feGaussianBlur stdDeviation="2.5"/>
                                                <feComposite in2="hardAlpha" operator="out"/>
                                                <feColorMatrix type="matrix"
                                                               values="0 0 0 0 0.2625 0 0 0 0 0.469 0 0 0 0 1 0 0 0 1 0"/>
                                                <feBlend mode="normal" in2="BackgroundImageFix"
                                                         result="effect1_dropShadow_1_58"/>
                                                <feBlend mode="normal" in="SourceGraphic" in2="effect1_dropShadow_1_58"
                                                         result="shape"/>
                                            </filter>
                                        </defs>
                                    </svg>
                                </div>
                            </div>
                        </div>

                    </div>
                </div>
                <div className={'d-flex align-items-center gap-2'} style={{width: '50%'}}>
                    <div>
                        <img src={image1} alt="" style={{borderRadius: "50%", width: "25px", height: "25px"}}/>
                    </div>
                    <div style={{fontSize: '16px', fontWeight: "400px"}}>
                        {firstname}
                    </div>
                </div>
            </div>
            <div className={'d-flex'} style={{width: "100%", height: '100%'}}>
                <div className={'leftBox'}>
                    <div style={{padding: "30px"}}>
                        <p>Регистрация</p>
                        <p>Личный кабинет</p>
                    </div>
                </div>
                <div className={'rightBox'}>
                    <div className={'d-flex align-items-center justify-content-between'}>
                        <div className={'d-flex gap-4'}>
                            <div className={"rigtBoxForImage"}>
                                <div className={'rigtBoxForImageIn'}>
                                    <p className={'mt-2'}>+</p>
                                </div>
                            </div>
                            <div>
                                <p className={'mb-1 mt-2'}>{firstname} {lastname}</p>
                                <p>
                                    <svg width="19" height="6" viewBox="0 0 19 6" fill="none"
                                         xmlns="http://www.w3.org/2000/svg">
                                        <rect y="0.5" width="19" height="5" fill="#FF3D00"/>
                                    </svg>
                                    Москва
                                </p>
                            </div>
                        </div>
                        <div className={'d-flex gap-1'}>
                            <div>
                                <svg width="18" height="19" viewBox="0 0 18 19" fill="none"
                                     xmlns="http://www.w3.org/2000/svg">
                                    <circle cx="9" cy="9.5" r="9" fill="#366EFF"/>
                                </svg>

                            </div>
                            <div>
                                4
                            </div>
                        </div>
                    </div>
                    <button className={'personalPageForButton '}>Скрыть подробности</button>
                    <div className={'box mt-3'}>
                        <div className={'d-flex align-items-center justify-content-between '}>
                            <div style={{color: '#818697'}}>Личные данные</div>
                            <div className={'position-relative'} onClick={() => history('/personal')}>
                                <div>
                                    <svg width="14" height="15" viewBox="0 0 14 15" fill="none"
                                         xmlns="http://www.w3.org/2000/svg">
                                        <path
                                            d="M10.8098 14.64H3.18982C2.36235 14.64 1.56876 14.3113 0.983651 13.7262C0.398538 13.141 0.0698242 12.3475 0.0698242 11.52V3.89999C0.06982 3.07159 0.398214 2.27698 0.983042 1.69027C1.56787 1.10357 2.36143 0.772636 3.18982 0.769989H5.70982C5.84115 0.769989 5.97118 0.795855 6.09251 0.846109C6.21383 0.896364 6.32407 0.970024 6.41693 1.06288C6.50979 1.15574 6.58345 1.26598 6.6337 1.38731C6.68396 1.50863 6.70982 1.63867 6.70982 1.76999C6.70982 1.90131 6.68396 2.03135 6.6337 2.15267C6.58345 2.274 6.50979 2.38424 6.41693 2.4771C6.32407 2.56995 6.21383 2.64361 6.09251 2.69387C5.97118 2.74412 5.84115 2.76999 5.70982 2.76999H3.18982C2.89187 2.77263 2.60701 2.89284 2.39725 3.10447C2.18749 3.3161 2.06981 3.60202 2.06982 3.89999V11.52C2.06982 11.817 2.18782 12.1019 2.39786 12.3119C2.60791 12.522 2.89278 12.64 3.18982 12.64H10.8098C11.1069 12.64 11.3917 12.522 11.6018 12.3119C11.8118 12.1019 11.9298 11.817 11.9298 11.52V7.70999C11.9298 7.44477 12.0352 7.19042 12.2227 7.00288C12.4103 6.81535 12.6646 6.70999 12.9298 6.70999C13.195 6.70999 13.4494 6.81535 13.6369 7.00288C13.8245 7.19042 13.9298 7.44477 13.9298 7.70999V11.52C13.9298 12.3475 13.6011 13.141 13.016 13.7262C12.4309 14.3113 11.6373 14.64 10.8098 14.64V14.64Z"
                                            fill="#366EFF"/>
                                    </svg>
                                </div>
                                <div className={'position-absolute'} style={{top: "-2px", left: '5px'}}>
                                    <svg width="10" height="13" viewBox="0 0 10 13" fill="none"
                                         xmlns="http://www.w3.org/2000/svg">
                                        <path
                                            d="M9.72987 2.74C9.66331 2.48379 9.49789 2.26443 9.26987 2.13L6.54987 0.499996C6.32177 0.364776 6.04931 0.325685 5.7924 0.39132C5.53548 0.456955 5.31516 0.621941 5.17987 0.849996L0.649868 8.43C0.541217 8.61028 0.492224 8.82025 0.509868 9.03L0.729867 11.76C0.74304 11.9198 0.794432 12.074 0.879709 12.2098C0.964987 12.3455 1.08165 12.4588 1.21987 12.54C1.37422 12.6316 1.55038 12.6799 1.72987 12.68C1.86824 12.6801 2.00489 12.6494 2.12987 12.59L4.63987 11.49C4.82883 11.4034 4.98612 11.2601 5.08987 11.08L9.61987 3.5C9.68738 3.38681 9.73185 3.2614 9.75073 3.13098C9.7696 3.00055 9.76252 2.86768 9.72987 2.74V2.74ZM7.32987 3.48L3.56987 9.78C3.51999 9.86012 3.44667 9.92296 3.35987 9.96L2.69987 10.25C2.68294 10.2586 2.66407 10.2627 2.64509 10.2619C2.62611 10.2611 2.60766 10.2554 2.59155 10.2453C2.57544 10.2352 2.56221 10.2212 2.55315 10.2045C2.54409 10.1878 2.53952 10.169 2.53987 10.15L2.47987 9.44C2.46957 9.34266 2.49059 9.24457 2.53987 9.16L6.29987 2.86C6.32644 2.82049 6.36688 2.7924 6.41318 2.78129C6.45948 2.77018 6.50826 2.77685 6.54987 2.8L7.26987 3.23C7.30937 3.25657 7.33746 3.29701 7.34857 3.34331C7.35969 3.3896 7.35301 3.43839 7.32987 3.48V3.48Z"
                                            fill="#366EFF"/>
                                    </svg>
                                </div>
                            </div>
                        </div>
                        <div className={'d-flex justify-content-between mt-3'}>
                            <div className={'d-flex gap-2'}>
                                <div>
                                    <svg width="19" height="6" viewBox="0 0 19 6" fill="none"
                                         xmlns="http://www.w3.org/2000/svg">
                                        <rect y="0.5" width="19" height="5" fill="#FF3D00"/>
                                    </svg>
                                </div>
                                <div style={{fontWeight: "bold"}}>

                                </div>
                            </div>
                            <div>
                                <div className={'d-flex gap-2'}>
                                    <div className={'position-relative'}>
                                        <div>
                                            <svg width="14" height="18" viewBox="0 0 14 18" fill="none"
                                                 xmlns="http://www.w3.org/2000/svg">
                                                <path
                                                    d="M7.00014 17.23C6.60266 17.227 6.21944 17.0816 5.92014 16.82C4.33014 15.43 0.640137 11.7 0.640137 7.11999C0.651279 6.27512 0.830924 5.44097 1.16855 4.6664C1.50617 3.89184 1.99498 3.19245 2.60634 2.6092C3.2177 2.02596 3.93931 1.57059 4.7289 1.26978C5.51849 0.968964 6.36017 0.828757 7.20463 0.857372C8.04909 0.885986 8.87935 1.08285 9.64677 1.43642C10.4142 1.78999 11.1033 2.29316 11.6738 2.91645C12.2443 3.53975 12.6846 4.27062 12.969 5.06626C13.2534 5.8619 13.3762 6.7063 13.3301 7.54999C13.1101 12.08 9.57014 15.55 8.06014 16.84C7.76325 17.0899 7.38819 17.2279 7.00014 17.23V17.23ZM7.00014 2.76999C5.94767 2.76288 4.92948 3.14381 4.14014 3.83999C3.63319 4.36897 3.24234 4.99803 2.99265 5.68684C2.74295 6.37566 2.63992 7.10904 2.69014 7.83999C3.03014 10.84 5.37014 13.5 6.69014 14.76C6.77808 14.8467 6.89663 14.8953 7.02014 14.8953C7.14365 14.8953 7.26219 14.8467 7.35014 14.76C8.70014 13.48 11.1901 10.71 11.3501 7.41999C11.4266 6.33999 11.0967 5.2704 10.4251 4.42117C9.75348 3.57194 8.7887 3.00441 7.72014 2.82999C7.48209 2.79111 7.24134 2.77104 7.00014 2.76999V2.76999Z"
                                                    fill="#366EFF"/>
                                            </svg>
                                        </div>
                                        <div className={'position-absolute'} style={{top: '-1px', left: '4px'}}>
                                            <svg width="6" height="6" viewBox="0 0 6 6" fill="none"
                                                 xmlns="http://www.w3.org/2000/svg">
                                                <path
                                                    d="M3.00035 5.94001C2.43032 5.94199 1.87252 5.77476 1.3976 5.45951C0.922668 5.14426 0.551975 4.69516 0.33246 4.16908C0.112946 3.64301 0.0544839 3.06362 0.164477 2.5043C0.274471 1.94498 0.547973 1.43088 0.950347 1.0271C1.35272 0.623325 1.86587 0.348037 2.4248 0.236099C2.98374 0.124161 3.56333 0.180607 4.09016 0.39829C4.61699 0.615974 5.06738 0.985103 5.38428 1.45893C5.70118 1.93276 5.87035 2.48997 5.87035 3.06001C5.87036 3.8221 5.5683 4.55313 5.03036 5.09295C4.49242 5.63277 3.76244 5.93736 3.00035 5.94001V5.94001ZM3.00035 2.19001C2.82547 2.18803 2.65396 2.23821 2.50773 2.33414C2.36149 2.43007 2.24715 2.5674 2.17931 2.7286C2.11147 2.8898 2.0932 3.06756 2.12684 3.23919C2.16047 3.41082 2.24449 3.56854 2.36816 3.6922C2.49182 3.81587 2.64954 3.89989 2.82117 3.93352C2.9928 3.96716 3.17056 3.94889 3.33176 3.88105C3.49296 3.81321 3.63029 3.69887 3.72622 3.55263C3.82215 3.4064 3.87233 3.23489 3.87035 3.06001C3.87035 2.82927 3.77869 2.60798 3.61554 2.44482C3.45238 2.28167 3.23109 2.19001 3.00035 2.19001V2.19001Z"
                                                    fill="#366EFF"/>
                                            </svg>
                                        </div>
                                    </div>
                                    <div style={{fontWeight: "bold"}}>{}</div>
                                </div>
                            </div>
                        </div>
                        <div className={'d-flex gap-4 mt-3'}>
                            <p>Пол: {data.sex}</p>
                            <p>Возраст: {data.birthDate} лет</p>
                            <p>Cтатус: {data.personStatusId}</p>
                        </div>
                    </div>
                    <div className={'box mt-3'}>
                        <div className={'d-flex align-items-center justify-content-between '}>
                            <div style={{color: '#818697'}}>Навыки</div>
                            <div className={'position-relative'}>
                                <div>
                                    <svg width="14" height="15" viewBox="0 0 14 15" fill="none"
                                         xmlns="http://www.w3.org/2000/svg">
                                        <path
                                            d="M10.8098 14.64H3.18982C2.36235 14.64 1.56876 14.3113 0.983651 13.7262C0.398538 13.141 0.0698242 12.3475 0.0698242 11.52V3.89999C0.06982 3.07159 0.398214 2.27698 0.983042 1.69027C1.56787 1.10357 2.36143 0.772636 3.18982 0.769989H5.70982C5.84115 0.769989 5.97118 0.795855 6.09251 0.846109C6.21383 0.896364 6.32407 0.970024 6.41693 1.06288C6.50979 1.15574 6.58345 1.26598 6.6337 1.38731C6.68396 1.50863 6.70982 1.63867 6.70982 1.76999C6.70982 1.90131 6.68396 2.03135 6.6337 2.15267C6.58345 2.274 6.50979 2.38424 6.41693 2.4771C6.32407 2.56995 6.21383 2.64361 6.09251 2.69387C5.97118 2.74412 5.84115 2.76999 5.70982 2.76999H3.18982C2.89187 2.77263 2.60701 2.89284 2.39725 3.10447C2.18749 3.3161 2.06981 3.60202 2.06982 3.89999V11.52C2.06982 11.817 2.18782 12.1019 2.39786 12.3119C2.60791 12.522 2.89278 12.64 3.18982 12.64H10.8098C11.1069 12.64 11.3917 12.522 11.6018 12.3119C11.8118 12.1019 11.9298 11.817 11.9298 11.52V7.70999C11.9298 7.44477 12.0352 7.19042 12.2227 7.00288C12.4103 6.81535 12.6646 6.70999 12.9298 6.70999C13.195 6.70999 13.4494 6.81535 13.6369 7.00288C13.8245 7.19042 13.9298 7.44477 13.9298 7.70999V11.52C13.9298 12.3475 13.6011 13.141 13.016 13.7262C12.4309 14.3113 11.6373 14.64 10.8098 14.64V14.64Z"
                                            fill="#366EFF"/>
                                    </svg>
                                </div>
                                <div className={'position-absolute'} style={{top: "-2px", left: '5px'}}>
                                    <svg width="10" height="13" viewBox="0 0 10 13" fill="none"
                                         xmlns="http://www.w3.org/2000/svg">
                                        <path
                                            d="M9.72987 2.74C9.66331 2.48379 9.49789 2.26443 9.26987 2.13L6.54987 0.499996C6.32177 0.364776 6.04931 0.325685 5.7924 0.39132C5.53548 0.456955 5.31516 0.621941 5.17987 0.849996L0.649868 8.43C0.541217 8.61028 0.492224 8.82025 0.509868 9.03L0.729867 11.76C0.74304 11.9198 0.794432 12.074 0.879709 12.2098C0.964987 12.3455 1.08165 12.4588 1.21987 12.54C1.37422 12.6316 1.55038 12.6799 1.72987 12.68C1.86824 12.6801 2.00489 12.6494 2.12987 12.59L4.63987 11.49C4.82883 11.4034 4.98612 11.2601 5.08987 11.08L9.61987 3.5C9.68738 3.38681 9.73185 3.2614 9.75073 3.13098C9.7696 3.00055 9.76252 2.86768 9.72987 2.74V2.74ZM7.32987 3.48L3.56987 9.78C3.51999 9.86012 3.44667 9.92296 3.35987 9.96L2.69987 10.25C2.68294 10.2586 2.66407 10.2627 2.64509 10.2619C2.62611 10.2611 2.60766 10.2554 2.59155 10.2453C2.57544 10.2352 2.56221 10.2212 2.55315 10.2045C2.54409 10.1878 2.53952 10.169 2.53987 10.15L2.47987 9.44C2.46957 9.34266 2.49059 9.24457 2.53987 9.16L6.29987 2.86C6.32644 2.82049 6.36688 2.7924 6.41318 2.78129C6.45948 2.77018 6.50826 2.77685 6.54987 2.8L7.26987 3.23C7.30937 3.25657 7.33746 3.29701 7.34857 3.34331C7.35969 3.3896 7.35301 3.43839 7.32987 3.48V3.48Z"
                                            fill="#366EFF"/>
                                    </svg>
                                </div>
                            </div>
                        </div>
                        <div className={'mt-2 d-flex'}>
                            {skills.map((value, index) => {
                                return <span className={'p-1 text-center'}
                                             style={{
                                                 background: '#366EFF',
                                                 borderRadius: "5px",
                                                 color: "white"
                                             }}>{value}</span>
                            })}
                        </div>
                    </div>
                </div>

            </div>
        </div>
    );
};

export default MainPage;